[
  {
    "title": "LEVEL 1 AUTHENTICATION",
    "location": "Restricted Access Terminal",
    "date": "Unknown",
    "author": "Ancient Security System",
    "content": "DEEP CORE SECURITY - LEVEL 1\n\nVERSE I PASSPHRASE REQUIRED:",
    "security_level": "high",
    "requires_password": true,
    "password": "SOMETHING",
    "attemptsAllowed": 3,
    "on_success": "Level 1 Authentication successful.\nProceeding to Level 2...",
    "on_failure": "Authentication failed. Consult Verse I of the Deep Core Hymnal.",
    "next_log": {
      "title": "LEVEL 2 AUTHENTICATION",
      "location": "Restricted Access Terminal",
      "date": "Unknown",
      "author": "Ancient Security System",
      "content": "DEEP CORE SECURITY - LEVEL 2\n\nVERSE II PASSPHRASE REQUIRED:",
      "security_level": "high",
      "requires_password": true,
      "password": "PERFECT",
      "attemptsAllowed": 3,
      "on_success": "Level 2 Authentication successful.\nProceeding to Level 3...",
      "on_failure": "Authentication failed. Consult Verse II of the Deep Core Hymnal.",
      "next_log": {
        "title": "LEVEL 3 AUTHENTICATION",
        "location": "Restricted Access Terminal",
        "date": "Unknown",
        "author": "Ancient Security System",
        "content": "DEEP CORE SECURITY - LEVEL 3\n\nVERSE III PASSPHRASE REQUIRED:",
        "security_level": "high",
        "requires_password": true,
        "password": "BEHIND THE EYE",
        "attemptsAllowed": 3,
        "on_success": "Level 3 Authentication successful.\nProceeding to final authentication level...",
        "on_failure": "Authentication failed. Consult Verse III of the Deep Core Hymnal.",
        "next_log": {
          "title": "LEVEL 4 AUTHENTICATION",
          "location": "Restricted Access Terminal",
          "date": "Unknown",
          "author": "Ancient Security System",
          "content": "DEEP CORE SECURITY - LEVEL 4\n\nVERSE IV PASSPHRASE REQUIRED:",
          "security_level": "high",
          "requires_password": true,
          "password": "MADE US",
          "attemptsAllowed": 3,
          "on_success": "Final authentication successful.\n\nAccessing RIFTJAW DEEP CORE archives...\n\n[DECRYPTING...]\n\nArchive access granted. Displaying historical record.",
          "on_failure": "Authentication failed. Consult Verse IV of the Deep Core Hymnal.",
          "next_log": {
            "title": "RIFTJAW DEEP CORE ARCHIVE",
            "location": "Ancient Data Repository",
            "date": "Approximately 20,000 Standard Years Ago",
            "author": "Builder Collective - Final Archive",
            "content": "RIFTJAW DEEP CORE: CLASSIFIED DOCUMENTATION\n\n[Translation from Ancient Dialect Complete - 97.3% Accuracy]\n\nTo those who discover this archive, understand that what you call 'Riftjaw' is not a mythical creature but the culmination of our greatest technological achievement – a vast computational system designed for a singular purpose: the safe containment and harnessing of the Eclipse Shard.\n\n==== HISTORICAL CONTEXT ====\n\nOur civilization discovered the Eclipse Shard approximately 23,000 standard years ago when it crashed into what is now the Riftjaw Rim. Initial contact proved catastrophic – the Shard's energy signature destabilized our quantum networks and affected the neural patterns of those exposed.\n\nWe quickly determined the Shard was a fragment of something vast and ancient, possibly predating this galaxy. Its power potential was immeasurable, but so too was its danger.\n\n==== RIFTJAW SYSTEM ARCHITECTURE ====\n\nThe RIFTJAW (Resonant Integration Field & Temporal-Josephson Adaptive Waveform) superstructure consists of several integrated components:\n\n1. CORE CHAMBER: Houses the primary Eclipse Shard fragment in perfect quantum suspension. The chamber resembles an enormous eye when viewed from specific angles, leading to the mythological misinterpretation.\n\n2. COOLING NETWORKS: The scale-like external structures are actually advanced cooling systems necessary to manage the intense energy generated by the Shard.\n\n3. STABILIZATION MATRIX: A network of tunnels filled with superconducting materials in precise geometric patterns, distributing and balancing energy throughout the system.\n\n4. MONITORING SUBSTATIONS: Sensor arrays resembling neural clusters that constantly analyze energy fluctuations and make automatic adjustments.\n\n==== THE ECLIPSE SHARD ====\n\nThe Shard defies conventional analysis. Our studies indicate it exists partially in our dimension and partially... elsewhere. Its energy signature suggests capabilities including:\n\n- Unlimited clean energy generation\n- Manipulation of local spacetime\n- Enhancement of consciousness/psionic potential\n- Possible communication with other dimensions\n\nCRITICAL WARNING: THE SHARD MUST REMAIN INTACT AND PROPERLY CONTAINED\n\nAny attempt to remove fragments from the main Shard or from the RIFTJAW containment system will create dangerous instability. The system is designed to maintain balance – the geological metaphor of 'scales' used in later mythology is surprisingly apt.\n\n==== MAINTENANCE PROTOCOL ====\n\nIf you are reading this, our civilization has likely passed into history. The RIFTJAW system was designed to be self-sustaining for at least 50,000 years, but may require intervention if significant damage occurs.\n\nShould the Shard ever be fragmented or removed from the core chamber, immediate restoration is imperative. The system has built-in defensive measures that will activate automatically to protect itself and restore balance – these may manifest as seismic events, energy discharges, or other phenomena that could be interpreted as an 'awakening' by those unfamiliar with the technology.\n\n==== FINAL NOTES ====\n\nWe built RIFTJAW beneath what would become Caldonis because the geological formation was ideal for the containment system. The city that grew above it has, unknowingly, been powered and protected by the Shard for millennia.\n\nThe mythology that developed around 'Riftjaw' as a sleeping guardian contains more truth than its believers know. The system does indeed 'sleep' in its steady-state operation, and it will 'awaken' defensive protocols if the balance is threatened.\n\nMay this knowledge serve you well. The power of the Eclipse Shard could elevate your civilization to new heights – or destroy it completely if mishandled.\n\nRemember: Something perfect behind the eye made us what we are today. Do not squander this inheritance.\n\n[END OF ARCHIVE]",
            "security_level": "high",
            "requires_roll": false
          }
        }
      }
    }
  }
]