[
  {
    "title": "BLACKSITE ES1 - Facility Overview",
    "location": "Blacksite ES1 Terminal",
    "date": "085-1105",
    "author": "Dr. Mordova, Site Director",
    "content": "BLACKSITE ES1 - FACILITY OVERVIEW\n\nLocation: Coordinates redacted, Helix Nebula, Sector 7\nSecurity Level: OMEGA\nPrimary Purpose: Eclipse Shard Research & Containment\n\nFacility Sections:\n- Alpha Wing: Administration & Security Operations\n- Beta Wing: Research Laboratories & Data Analysis\n- Gamma Wing: Specialized Containment Units (Subject E. Trevar)\n- Delta Wing: Staff Quarters & Medical Facilities\n\nThe unique gravitational conditions at this location enhance the Shard's properties while simultaneously allowing for more effective containment. All personnel are reminded that exposure protocols are non-negotiable.\n\nCurrent research priorities:\n1. Neural synchronization between Subject Trevar and the Shard\n2. Dimensional resonance patterns observed in laboratory conditions\n3. Enhanced cognitive abilities in exposed test subjects\n4. Possible applications for FTL communication\n\nReminder: All communications and research data are automatically encrypted and routed through dummy relays. Physical access to this facility requires three-factor authentication and executive clearance.",
    "security_level": "high",
    "requires_roll": false
  },
  {
    "title": "Subject Trevar - Containment Logs",
    "location": "Blacksite ES1 Terminal",
    "date": "086-1105",
    "author": "Dr. Yuran Tazeel, Lead Researcher",
    "content": "SUBJECT: ELIAS TREVAR\nSTATUS: CONTAINED - SPECIAL PROTOCOLS\n\nDay 146 of continuous observation\n\nSubject's neural synchronization with the Eclipse Shard has reached unprecedented levels. Standard containment protocols were insufficient after day 90. We've implemented a specialized chamber utilizing quantum field inhibitors and psionic dampeners.\n\nThe subject no longer requires verbal communication. Thoughts are directly transmitted to sensitives on our research team. Most concerning is his ability to accurately predict events before they occur and perceive information from outside his containment cell without any apparent sensory input.\n\nKey observations from today's session:\n1. Subject described detailed layouts of sections of the facility he has never visited\n2. Subject referenced conversations between staff members that occurred in private\n3. Subject named the crew members of supply ship arriving tomorrow\n4. Subject warned of \"thinning barriers between what is and what could be\"\n\nRecommendation: Increase psionic dampening by 40%. Rotate research staff every 48 hours to minimize exposure to subject. Consider evacuation protocols if synchronization exceeds 95%.",
    "security_level": "high",
    "requires_roll": true,
    "roll_check": {
      "difficulty": 10,
      "skill": "Electronics (Computers)",
      "on_success": "Access granted. Containment logs decrypted.",
      "on_failure": "Access denied. Security notification triggered."
    }
  },
  {
    "title": "Eclipse Shard - Research Summary",
    "location": "Blacksite ES1 Terminal",
    "date": "079-1105",
    "author": "Research Division",
    "content": "ECLIPSE SHARD - COMPREHENSIVE ANALYSIS\n\nOrigin: Unknown. Material composition does not match any known element or compound. Theoretical models suggest extra-dimensional origin.\n\nPhysical Properties:\n- Appears as a crystalline fragment approximately 15cm x 8cm x 7cm\n- Color shifts between deep black and iridescent purple depending on observer angle\n- Mass fluctuates under observation, violating conservation laws\n- Temperature remains constant at 3.7K regardless of environmental conditions\n- Demonstrates quantum superposition under certain test conditions\n\nPsychological/Neural Effects:\n- Proximity exposure (>30 minutes) leads to neurological changes\n- Enhanced perception (electromagnetic, quantum fields)\n- Development of anomalous cognitive abilities\n- Subject-specific manifestations (varies by individual)\n- Apparent addiction-like dependency with prolonged exposure\n\nMost subjects develop painful withdrawal symptoms when separated from the Shard after extended exposure. Subject Trevar represents our most integrated case, demonstrating abilities that defy conventional explanation.\n\nHypothesis: The Shard is a fragment of a larger artifact of non-human origin, possibly a communication device or consciousness-altering technology. Its effect on human neural architecture suggests it may be interfacing with or altering fundamental aspects of perception and cognition.\n\nWARNING: All research personnel are to be rotated after 20 hours of cumulative Shard exposure. Mandatory neural scans required weekly. Any unauthorized exposure will result in immediate quarantine.",
    "security_level": "high",
    "requires_roll": true,
    "roll_check": {
      "difficulty": 12,
      "skill": "Electronics (Computers)",
      "on_success": "Access granted. Research data decrypted.",
      "on_failure": "Access denied. Security countermeasures activated."
    }
  },
  {
    "title": "Emergency Protocol - Containment Breach",
    "location": "Blacksite ES1 Terminal",
    "date": "087-1105",
    "author": "Security Division",
    "content": "EMERGENCY PROTOCOL: CONTAINMENT BREACH\n\nThis document outlines procedures to be followed in the event of Subject Trevar achieving containment breach or loss of Shard containment:\n\n1. IMMEDIATE ACTIONS:\n   - Automated lockdown of Gamma Wing\n   - Deployment of suppression fields in all connecting corridors\n   - Release of aerosolized psionic suppressants\n   - Evacuation of all non-essential personnel to emergency shuttles\n\n2. SECURITY RESPONSE:\n   - Tactical team Alpha will secure Subject Trevar using non-lethal methods\n   - Tactical teams Beta and Gamma will secure the Eclipse Shard\n   - Subject must be separated from Shard immediately\n\n3. WORST-CASE SCENARIO - PROTOCOL OMEGA:\n   If Subject and Shard cannot be secured within 30 minutes of breach:\n   - Station self-destruct sequence will be initiated\n   - All data will be transmitted to backup facility\n   - Remaining personnel will evacuate via emergency pods\n   - Automated beacon will warn all approaching vessels\n\nAUTHORIZATION CODES FOR PROTOCOL OMEGA:\n   Primary: ECLIPSE-SHADOW-FALL-93472\n   Secondary: VOID-COLLAPSE-83901-TERMINUS\n   Tertiary: BEYOND-EVENT-HORIZON-12583\n\nNOTE: All three authorization codes must be entered by separate command staff with Level Omega clearance within 60 seconds of each other to initiate Protocol Omega.",
    "security_level": "high",
    "requires_roll": true,
    "roll_check": {
      "difficulty": 14,
      "skill": "Electronics (Computers)",
      "on_success": "Access granted. Emergency protocols decrypted.",
      "on_failure": "Access denied. Security alert triggered."
    }
  },
  {
    "title": "Director's Personal Log",
    "location": "Blacksite ES1 Terminal",
    "date": "088-1105",
    "author": "Dr. Mordova, Site Director",
    "content": "Personal Log - Dr. Elena Mordova\nDay 151\n\nI've begun experiencing the dreams. Just like the other researchers with extended exposure. Always the same pattern - vast geometric spaces folding in impossible ways, and something moving between them. Watching us. Studying us, just as we study it.\n\nTrevar is getting stronger. Yesterday he named my childhood pet - information that exists nowhere in any database. When I asked how he knew, he simply smiled and said, \"I can see all the paths you've walked.\"\n\nSomething is happening to the fabric of reality around the Shard. Sensors in Gamma Wing have begun picking up temporal anomalies - microscopic variances in the flow of time. Objects occasionally appear to move before they're touched. Security footage shows momentary duplications of staff members.\n\nI fear we've gone too far. The corporate board insists on pushing forward, demanding weaponization protocols and enhanced extraction of Trevar's abilities. They don't understand what we're dealing with. This isn't just a powerful object or energy source - it's a doorway. And Trevar is halfway through it already.\n\nI've taken the precaution of updating Protocol Omega. If containment fails completely, this facility and everything in it must be destroyed. The risk is too great.\n\nIf anyone finds this log, a final warning: The Eclipse Shard isn't a tool to be used. It's using us.",
    "security_level": "high",
    "requires_roll": true,
    "roll_check": {
      "difficulty": 14,
      "skill": "Electronics (Computers)",
      "on_success": "Access granted. Personal log decrypted.",
      "on_failure": "Access denied. Security lockout initiated."
    }
  }
]